GreatCowBASIC/DATFileGenerator/incfiles/p18F57Q84.inc
;----- C1BDIAG1T Bits -----------------------------------------------------
DBIT0ERR         EQU  H'0000'
DBIT1ERR         EQU  H'0001'
DFORMERR         EQU  H'0003'
DSTUFERR         EQU  H'0004'
DCRCERR          EQU  H'0005'
ESI              EQU  H'0006'
DLCMM            EQU  H'0007'


;----- C1TEFCONL Bits -----------------------------------------------------
TEFNEIE          EQU  H'0000'
TEFHIE           EQU  H'0001'
TEFFIE           EQU  H'0002'
TEFOVIE          EQU  H'0003'
TEFTSEN          EQU  H'0005'


;----- C1TEFCONH Bits -----------------------------------------------------
UINC             EQU  H'0000'
FRESET           EQU  H'0002'


;----- C1TEFCONT Bits -----------------------------------------------------
FSIZE0           EQU  H'0000'
FSIZE1           EQU  H'0001'
FSIZE2           EQU  H'0002'
FSIZE3           EQU  H'0003'
FSIZE4           EQU  H'0004'


;----- C1TEFSTAL Bits -----------------------------------------------------
TEFNEIF          EQU  H'0000'
TEFHIF           EQU  H'0001'
TEFFIF           EQU  H'0002'
TEFOVIF          EQU  H'0003'


;----- C1TEFUA Bits -----------------------------------------------------
TEFUA0           EQU  H'0000'
TEFUA1           EQU  H'0001'
TEFUA2           EQU  H'0002'
TEFUA3           EQU  H'0003'
TEFUA4           EQU  H'0004'
TEFUA5           EQU  H'0005'
TEFUA6           EQU  H'0006'
TEFUA7           EQU  H'0007'


;----- C1TEFUAH Bits -----------------------------------------------------
TEFUA8           EQU  H'0000'
TEFUA9           EQU  H'0001'
TEFUA10          EQU  H'0002'
TEFUA11          EQU  H'0003'
TEFUA12          EQU  H'0004'
TEFUA13          EQU  H'0005'
TEFUA14          EQU  H'0006'
TEFUA15          EQU  H'0007'


;----- C1TEFUAU Bits -----------------------------------------------------
TEFUA16          EQU  H'0000'
TEFUA17          EQU  H'0001'
TEFUA18          EQU  H'0002'
TEFUA19          EQU  H'0003'
TEFUA20          EQU  H'0004'
TEFUA21          EQU  H'0005'
TEFUA22          EQU  H'0006'
TEFUA23          EQU  H'0007'


;----- C1TEFUAT Bits -----------------------------------------------------
TEFUA24          EQU  H'0000'
TEFUA25          EQU  H'0001'
TEFUA26          EQU  H'0002'
TEFUA27          EQU  H'0003'
TEFUA28          EQU  H'0004'
TEFUA29          EQU  H'0005'
TEFUA30          EQU  H'0006'
TEFUA31          EQU  H'0007'


;----- C1FIFOBA Bits -----------------------------------------------------
FIFOBA0          EQU  H'0000'
FIFOBA1          EQU  H'0001'
FIFOBA2          EQU  H'0002'
FIFOBA3          EQU  H'0003'
FIFOBA4          EQU  H'0004'
FIFOBA5          EQU  H'0005'
FIFOBA6          EQU  H'0006'
FIFOBA7          EQU  H'0007'


;----- C1FIFOBAH Bits -----------------------------------------------------
FIFOBA8          EQU  H'0000'
FIFOBA9          EQU  H'0001'
FIFOBA10         EQU  H'0002'
FIFOBA11         EQU  H'0003'
FIFOBA12         EQU  H'0004'
FIFOBA13         EQU  H'0005'
FIFOBA14         EQU  H'0006'
FIFOBA15         EQU  H'0007'


;----- C1FIFOBAU Bits -----------------------------------------------------
FIFOBA16         EQU  H'0000'
FIFOBA17         EQU  H'0001'
FIFOBA18         EQU  H'0002'
FIFOBA19         EQU  H'0003'
FIFOBA20         EQU  H'0004'
FIFOBA21         EQU  H'0005'
FIFOBA22         EQU  H'0006'
FIFOBA23         EQU  H'0007'


;----- C1FIFOBAT Bits -----------------------------------------------------
FIFOBA24         EQU  H'0000'
FIFOBA25         EQU  H'0001'
FIFOBA26         EQU  H'0002'
FIFOBA27         EQU  H'0003'
FIFOBA28         EQU  H'0004'
FIFOBA29         EQU  H'0005'
FIFOBA30         EQU  H'0006'
FIFOBA31         EQU  H'0007'


;----- C1TXQCONL Bits -----------------------------------------------------
TXQNIE           EQU  H'0000'
TXQEIE           EQU  H'0002'
TXATIE           EQU  H'0004'
TXEN             EQU  H'0007'


;----- C1TXQCONH Bits -----------------------------------------------------
UINC             EQU  H'0000'
TXREQ            EQU  H'0001'
FRESET           EQU  H'0002'


;----- C1TXQCONU Bits -----------------------------------------------------
TXPRI0           EQU  H'0000'
TXPRI1           EQU  H'0001'
TXPRI2           EQU  H'0002'
TXPRI3           EQU  H'0003'
TXPRI4           EQU  H'0004'
TXAT0            EQU  H'0005'
TXAT1            EQU  H'0006'


;----- C1TXQCONT Bits -----------------------------------------------------
FSIZE0           EQU  H'0000'
FSIZE1           EQU  H'0001'
FSIZE2           EQU  H'0002'
FSIZE3           EQU  H'0003'
FSIZE4           EQU  H'0004'
PLSIZE0          EQU  H'0005'
PLSIZE1          EQU  H'0006'
PLSIZE2          EQU  H'0007'


;----- C1TXQSTAL Bits -----------------------------------------------------
TXQNIF           EQU  H'0000'
TXQEIF           EQU  H'0002'
TXATIF           EQU  H'0004'
TXERR            EQU  H'0005'
TXLARB           EQU  H'0006'
TXABT            EQU  H'0007'


;----- C1TXQSTAH Bits -----------------------------------------------------
TXQCI0           EQU  H'0000'
TXQCI1           EQU  H'0001'
TXQCI2           EQU  H'0002'
TXQCI3           EQU  H'0003'
TXQCI4           EQU  H'0004'


;----- C1TXQUA Bits -----------------------------------------------------
TXQUA0           EQU  H'0000'
TXQUA1           EQU  H'0001'
TXQUA2           EQU  H'0002'
TXQUA3           EQU  H'0003'
TXQUA4           EQU  H'0004'
TXQUA5           EQU  H'0005'
TXQUA6           EQU  H'0006'
TXQUA7           EQU  H'0007'


;----- C1TXQUAH Bits -----------------------------------------------------
TXQUA8           EQU  H'0000'
TXQUA9           EQU  H'0001'
TXQUA10          EQU  H'0002'
TXQUA11          EQU  H'0003'
TXQUA12          EQU  H'0004'
TXQUA13          EQU  H'0005'
TXQUA14          EQU  H'0006'
TXQUA15          EQU  H'0007'


;----- C1TXQUAU Bits -----------------------------------------------------
TXQUA16          EQU  H'0000'
TXQUA17          EQU  H'0001'
TXQUA18          EQU  H'0002'
TXQUA19          EQU  H'0003'
TXQUA20          EQU  H'0004'
TXQUA21          EQU  H'0005'
TXQUA22          EQU  H'0006'
TXQUA23          EQU  H'0007'


;----- C1TXQUAT Bits -----------------------------------------------------
TXQUA24          EQU  H'0000'
TXQUA25          EQU  H'0001'
TXQUA26          EQU  H'0002'
TXQUA27          EQU  H'0003'
TXQUA28          EQU  H'0004'
TXQUA29          EQU  H'0005'
TXQUA30          EQU  H'0006'
TXQUA31          EQU  H'0007'


;----- C1FIFOCON2 Bits -----------------------------------------------------
TFNRFNIE         EQU  H'0000'
TFHRFHIE         EQU  H'0001'
TFERFFIE         EQU  H'0002'
RXOVIE           EQU  H'0003'
TXATIE           EQU  H'0004'
RXTSEN           EQU  H'0005'
RTREN            EQU  H'0006'
TXEN             EQU  H'0007'


;----- C1FIFOCON2H Bits -----------------------------------------------------
UINC             EQU  H'0000'
TXREQ            EQU  H'0001'
FRESET           EQU  H'0002'


;----- C1FIFOCON2U Bits -----------------------------------------------------
TXPRI0           EQU  H'0000'
TXPRI1           EQU  H'0001'
TXPRI2           EQU  H'0002'
TXPRI3           EQU  H'0003'
TXPRI4           EQU  H'0004'
TXAT0            EQU  H'0005'
TXAT1            EQU  H'0006'


;----- C1FIFOCON2T Bits -----------------------------------------------------
FSIZE0           EQU  H'0000'
FSIZE1           EQU  H'0001'
FSIZE2           EQU  H'0002'
FSIZE3           EQU  H'0003'
FSIZE4           EQU  H'0004'
PLSIZE0          EQU  H'0005'
PLSIZE1          EQU  H'0006'
PLSIZE2          EQU  H'0007'


;----- C1FIFOSTA2 Bits -----------------------------------------------------
TFNRFNIF         EQU  H'0000'
TFHRFHIF         EQU  H'0001'
TFERFFIF         EQU  H'0002'
RXOVIF           EQU  H'0003'
TXATIF           EQU  H'0004'
TXERR            EQU  H'0005'
TXLARB           EQU  H'0006'
TXABT            EQU  H'0007'


;----- C1FIFOSTA2H Bits -----------------------------------------------------
FIFOCI0          EQU  H'0000'
FIFOCI1          EQU  H'0001'
FIFOCI2          EQU  H'0002'
FIFOCI3          EQU  H'0003'
FIFOCI4          EQU  H'0004'


