GreatCowBASIC/DATFileGenerator/incfiles/p18F57Q84.inc
;----- NCO3ACC Bits -----------------------------------------------------
NCO3ACC0         EQU  H'0000'
NCO3ACC1         EQU  H'0001'
NCO3ACC2         EQU  H'0002'
NCO3ACC3         EQU  H'0003'
NCO3ACC4         EQU  H'0004'
NCO3ACC5         EQU  H'0005'
NCO3ACC6         EQU  H'0006'
NCO3ACC7         EQU  H'0007'
ACC0             EQU  H'0000'
ACC1             EQU  H'0001'
ACC2             EQU  H'0002'
ACC3             EQU  H'0003'
ACC4             EQU  H'0004'
ACC5             EQU  H'0005'
ACC6             EQU  H'0006'
ACC7             EQU  H'0007'


;----- NCO3ACCH Bits -----------------------------------------------------
NCO3ACC8         EQU  H'0000'
NCO3ACC9         EQU  H'0001'
NCO3ACC10        EQU  H'0002'
NCO3ACC11        EQU  H'0003'
NCO3ACC12        EQU  H'0004'
NCO3ACC13        EQU  H'0005'
NCO3ACC14        EQU  H'0006'
NCO3ACC15        EQU  H'0007'
ACC8             EQU  H'0000'
ACC9             EQU  H'0001'
ACC10            EQU  H'0002'
ACC11            EQU  H'0003'
ACC12            EQU  H'0004'
ACC13            EQU  H'0005'
ACC14            EQU  H'0006'
ACC15            EQU  H'0007'


;----- NCO3ACCU Bits -----------------------------------------------------
NCO3ACC16        EQU  H'0000'
NCO3ACC17        EQU  H'0001'
NCO3ACC18        EQU  H'0002'
NCO3ACC19        EQU  H'0003'
NCO3ACC20        EQU  H'0004'
NCO3ACC21        EQU  H'0005'
NCO3ACC22        EQU  H'0006'
NCO3ACC23        EQU  H'0007'
ACC16            EQU  H'0000'
ACC17            EQU  H'0001'
ACC18            EQU  H'0002'
ACC19            EQU  H'0003'
ACC20            EQU  H'0004'
ACC21            EQU  H'0005'
ACC22            EQU  H'0006'
ACC23            EQU  H'0007'


;----- NCO3INC Bits -----------------------------------------------------
NCO3INC0         EQU  H'0000'
NCO3INC1         EQU  H'0001'
NCO3INC2         EQU  H'0002'
NCO3INC3         EQU  H'0003'
NCO3INC4         EQU  H'0004'
NCO3INC5         EQU  H'0005'
NCO3INC6         EQU  H'0006'
NCO3INC7         EQU  H'0007'
INC0             EQU  H'0000'
INC1             EQU  H'0001'
INC2             EQU  H'0002'
INC3             EQU  H'0003'
INC4             EQU  H'0004'
INC5             EQU  H'0005'
INC6             EQU  H'0006'
INC7             EQU  H'0007'


;----- NCO3INCH Bits -----------------------------------------------------
NCO3INC8         EQU  H'0000'
NCO3INC9         EQU  H'0001'
NCO3INC10        EQU  H'0002'
NCO3INC11        EQU  H'0003'
NCO3INC12        EQU  H'0004'
NCO3INC13        EQU  H'0005'
NCO3INC14        EQU  H'0006'
NCO3INC15        EQU  H'0007'
INC8             EQU  H'0000'
INC9             EQU  H'0001'
INC10            EQU  H'0002'
INC11            EQU  H'0003'
INC12            EQU  H'0004'
INC13            EQU  H'0005'
INC14            EQU  H'0006'
INC15            EQU  H'0007'


;----- NCO3INCU Bits -----------------------------------------------------
NCO3INC16        EQU  H'0000'
NCO3INC17        EQU  H'0001'
NCO3INC18        EQU  H'0002'
NCO3INC19        EQU  H'0003'
NCO3INC20        EQU  H'0004'
NCO3INC21        EQU  H'0005'
NCO3INC22        EQU  H'0006'
NCO3INC23        EQU  H'0007'
INC16            EQU  H'0000'
INC17            EQU  H'0001'
INC18            EQU  H'0002'
INC19            EQU  H'0003'
INC20            EQU  H'0004'
INC21            EQU  H'0005'
INC22            EQU  H'0006'
INC23            EQU  H'0007'


;----- NCO3CON Bits -----------------------------------------------------
PFM              EQU  H'0000'
POL_NCO3CON      EQU  H'0004'
OUT_NCO3CON      EQU  H'0005'
EN               EQU  H'0007'
NCO3PFM          EQU  H'0000'
NCO3POL          EQU  H'0004'
NCO3OUT          EQU  H'0005'
NCO3EN           EQU  H'0007'


;----- NCO3CLK Bits -----------------------------------------------------
CKS0             EQU  H'0000'
CKS1             EQU  H'0001'
CKS2             EQU  H'0002'
CKS3             EQU  H'0003'
PWS0             EQU  H'0005'
PWS1             EQU  H'0006'
PWS2             EQU  H'0007'
NCO3CKS0         EQU  H'0000'
NCO3CKS1         EQU  H'0001'
NCO3CKS2         EQU  H'0002'
NCO3CKS3         EQU  H'0003'
NCO3PWS0         EQU  H'0005'
NCO3PWS1         EQU  H'0006'
NCO3PWS2         EQU  H'0007'


;----- FSCMCON Bits -----------------------------------------------------
FSCMFEV          EQU  H'0000'
FSCMFFI          EQU  H'0001'
FSCMPEV          EQU  H'0002'
FSCMPFI          EQU  H'0003'
FSCMSEV          EQU  H'0004'
FSCMSFI          EQU  H'0005'


;----- IVTLOCK Bits -----------------------------------------------------
IVTLOCKED        EQU  H'0000'


;----- IVTBASE Bits -----------------------------------------------------
BASE0            EQU  H'0000'
BASE1            EQU  H'0001'
BASE2            EQU  H'0002'
BASE3            EQU  H'0003'
BASE4            EQU  H'0004'
BASE5            EQU  H'0005'
BASE6            EQU  H'0006'
BASE7            EQU  H'0007'


;----- IVTBASEH Bits -----------------------------------------------------
BASE8            EQU  H'0000'
BASE9            EQU  H'0001'
BASE10           EQU  H'0002'
BASE11           EQU  H'0003'
BASE12           EQU  H'0004'
BASE13           EQU  H'0005'
BASE14           EQU  H'0006'
BASE15           EQU  H'0007'


;----- IVTBASEU Bits -----------------------------------------------------
BASE16           EQU  H'0000'
BASE17           EQU  H'0001'
BASE18           EQU  H'0002'
BASE19           EQU  H'0003'
BASE20           EQU  H'0004'


;----- PWM2GIR Bits -----------------------------------------------------
S1P1IF           EQU  H'0000'
S1P2IF           EQU  H'0001'


;----- PWM2GIE Bits -----------------------------------------------------
S1P1IE           EQU  H'0000'
S1P2IE           EQU  H'0001'


;----- PWM2CON Bits -----------------------------------------------------
ERSNOW           EQU  H'0000'
ERSPOL           EQU  H'0001'
LD_PWM2CON       EQU  H'0002'
EN               EQU  H'0007'


;----- PWM2S1CFG Bits -----------------------------------------------------
PPEN             EQU  H'0003'
POL1             EQU  H'0006'
POL2             EQU  H'0007'
MODE0            EQU  H'0000'
MODE1            EQU  H'0001'
MODE2            EQU  H'0002'


;----- PWM3GIR Bits -----------------------------------------------------
S1P1IF           EQU  H'0000'
S1P2IF           EQU  H'0001'


